/*********************************************************/
// 定时器1初始化，用于秒表
/*********************************************************/
void TimerInit()
{
	TMOD = 0x10;			// 使用定时器1，工作方式是1	 
	ET1 = 1;					// 定时器1中断使能
	EA = 1;				// 打开总中断
}

/*********************************************************/
// 定时器1启动，用于秒表
/*********************************************************/
void Timer1(void) interrupt 3
{
	TH1 = 216;					// 给定时器1的TH0装初值
	TL1 = 240;					// 给定时器1的TL0装初值

	Stop_Watch_Count++;
	if (Stop_Watch_Count >= 100)
	{
		Stop_Watch_Count = 0;
		Stop_Watch_Second++;
	}
}
